Public Member Functions | Protected Member Functions | Friends | List of all members
ACAPI::Element::Opening::Modifier Class Referencefinal
Element Manager
#include <Opening.hpp>
 Inheritance diagram for ACAPI::Element::Opening::Modifier:
 Public Member Functions
ModifiableOpeningFloorPlanParameters  | GetFloorPlanParameters ()
Gives access to OpeningFloorPlanParameters for modification.
ModifiableOpeningExtrusionParameters  | GetExtrusionParameters ()
Gives access to OpeningExtrusionParameters for modification.
ModifiableOpeningGeometry  | GetOpeningGeometry ()
Gives access to OpeningGeometry for modification.
Result< void >  | ChangeParentElement (const UniqueID &newParentElementId)
Changes the Opening's parent element.
Result< void >  | AddCutElement (const UniqueID &elementToCutId)
Cuts an element by this opening.
Result< void >  | RemoveCutElement (const UniqueID &elementToRemoveConnectionId)
The opening will no longer cut this element. Opening will be deleted it the specified element is the opening's parent element!
 Protected Member Functions
Modifier (Opening &parent)
Constructs a Modifier with the given Opening parent.
 Friends
 class  | Opening
Detailed Description
It represents a modifiable Opening element.
Since
Archicad 29
Constructor & Destructor Documentation
◆ Modifier()
 ACAPI::Element::Opening::Modifier::Modifier  |  ( |  Opening & |  parent | )
protected
Constructs a Modifier with the given Opening parent.
Parameters
parent | The parent Opening.
Member Function Documentation
◆ AddCutElement()
 Result< void > ACAPI::Element::Opening::Modifier::AddCutElement  |  ( |  const UniqueID & |  elementToCutId | )
Cuts an element by this opening.
Parameters
elementToCutId | The ID of the element that will be cut by this opening.
Returns
Returns nothing if the operation was successful, or returns error:
if the ID points to a non-existing element;
if element's type specified by the ID can't be cut by Opening.
◆ ChangeParentElement()
 Result< void > ACAPI::Element::Opening::Modifier::ChangeParentElement  |  ( |  const UniqueID & |  newParentElementId | )
Changes the Opening's parent element.
Parameters
newParentElementId | The ID of the element Opening will use as it's new parent element.
Returns
Returns nothing if the operation was successful, or returns error:
if the ID points to a non-existing element;
if element's type specified by the ID can't be cut by Opening.
◆ GetExtrusionParameters()
 ModifiableOpeningExtrusionParameters ACAPI::Element::Opening::Modifier::GetExtrusionParameters  |  ( |   | )
Gives access to OpeningExtrusionParameters for modification.
Returns
Returns ModifiableOpeningExtrusionParameters
◆ GetFloorPlanParameters()
 ModifiableOpeningFloorPlanParameters ACAPI::Element::Opening::Modifier::GetFloorPlanParameters  |  ( |   | )
Gives access to OpeningFloorPlanParameters for modification.
Returns
Returns ModifiableOpeningFloorPlanParameters
◆ GetOpeningGeometry()
 ModifiableOpeningGeometry ACAPI::Element::Opening::Modifier::GetOpeningGeometry  |  ( |   | )
Gives access to OpeningGeometry for modification.
Returns
Returns ModifiableOpeningGeometry
◆ RemoveCutElement()
 Result< void > ACAPI::Element::Opening::Modifier::RemoveCutElement  |  ( |  const UniqueID & |  elementToRemoveConnectionId | )
The opening will no longer cut this element. Opening will be deleted it the specified element is the opening's parent element!
Parameters
elementToRemoveConnectionId | The ID of the element that will no longer be cut by this opening.
Returns
Returns nothing if the operation was successful, or returns error:
if the ID points to a non-existing element;
if element's type specified by the ID can't be cut by Opening.